# 8/25

## pymysql 설치

In [1]:
%pip install pymysql

Collecting pymysql
  Obtaining dependency information for pymysql from https://files.pythonhosted.org/packages/e5/30/20467e39523d0cfc2b6227902d3687a16364307260c75e6a1cb4422b0c62/PyMySQL-1.1.0-py3-none-any.whl.metadata
  Downloading PyMySQL-1.1.0-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/44.8 kB ? eta -:--:--
   ---------------------------------------- 44.8/44.8 kB 2.3 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

## MySQL 접속

In [2]:
import pymysql

- connect() 메서드

    -파라미터
    
        - host: 접속할 server 주소
        - port: 접속할 server의 포트번호
        - user: MySQL ID
        - passwd: ID의 암호 > 숫자만 있어도 문자열로 전달해야 정상적으로 연결이 가능하다
        - db: 접속할 데이터베이스
        - charset='utf8': MySQL에서 SELECT를 통해 데이터를 가져올 때 한글이 깨질 수 있으므로 연결 설정에 넣어 방지

In [4]:
# db 연결
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='1234', charset='utf8')
db

In [5]:
# 커서 불러오기
cursor = db.cursor()

# SQL문 실행(ecommerce DB 생성)
sql = "CREATE DATABASE IF NOT EXISTS ecommerce"
cursor.execute(sql) # 1이 나온 경우 정상적으로 실행

1

In [7]:
# 모든 DB 정보 조회
sql = "SHOW DATABASES"
cursor.execute(sql)
result = cursor.fetchall()
result

(('ecommerce',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('tabledb',),
 ('world',))

In [8]:
# DB 변경
sql = "USE ecommerce"
cursor.execute(sql) # 0이 나오면 정상 작동

0

In [9]:
# 현재 DB 확인
sql = "SELECT DATABASE()"
cursor.execute(sql)
result = cursor.fetchone()
result

('ecommerce',)

In [10]:
cursor # 커서의 객체 확인

In [11]:
# 테이블 생성 SQL 실행
sql = """
    CREATE TABLE product (
        PRODUCT_CODE VARCHAR(20) NOT NULL,
        TITLE VARCHAR(200) NOT NULL,
        ORI_PRICE INT,
        DISCOUNT_PRICE INT,
        DISCOUNT_PERCENT INT,
        DELIVERY VARCHAR(2),
        CONSTRAINT PRIMARY KEY FK_product_PRODUCT_CODE (PRODUCT_CODE)
    );
"""
cursor.execute(sql) # 0이 나오면 정상 실행

0

In [12]:
# 테이블 조회
sql = "SHOW TABLES"
cursor.execute(sql)
result = cursor.fetchall()
result

(('product',),)

In [13]:
db.close() # 연결 종료

# 8/28

## 패턴 익히기

In [7]:
# 라이브러리 가져오기
import pymysql

# DB 접속
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='1234',
                     db='ecommerce', charset='utf8')

In [3]:
# 커서 가져오기
cursor = db.cursor()

# SQL 구문 만들기
sql = '''
    CREATE TABLE product2 (
        PRODUCT_CODE VARCHAR(20) NOT NULL,
        TITLE VARCHAR(200) NOT NULL,
        ORI_PRICE INT,
        DISCOUNT_PRICE INT,
        DISCOUNT_PERCENT INT,
        DELIVERY VARCHAR(2),
        CONSTRAINT PRIMARY KEY PK_product2_PRUDUCT_CODE (PRODUCT_CODE)
    );
'''

In [4]:
# SQL 구문 실행
cursor.execute(sql)

0

In [5]:
# commit 하기
db.commit()

In [10]:
# db 연결 닫기
db.close()

## INSERT

In [11]:
# 접속하기
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='1234',
                     db='ecommerce', charset='utf8')

# 커서 가져오기
cursor = db.cursor()

In [14]:
sql = '''
    DESCRIBE product2;
'''

cursor.execute(sql)
result = cursor.fetchall()

In [15]:
result

(('PRODUCT_CODE', 'varchar(20)', 'NO', 'PRI', None, ''),
 ('TITLE', 'varchar(200)', 'NO', '', None, ''),
 ('ORI_PRICE', 'int', 'YES', '', None, ''),
 ('DISCOUNT_PRICE', 'int', 'YES', '', None, ''),
 ('DISCOUNT_PERCENT', 'int', 'YES', '', None, ''),
 ('DELIVERY', 'varchar(2)', 'YES', '', None, ''))

In [16]:
# 여러 개의 데이터를 for문으로 입력
for index in range(10):
    product_code = 216573140 + index + 1
    sql = """INSERT INTO product2 VALUES(
        '""" + str(product_code) + """', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');"""
    print(sql)
    cursor.execute(sql)

INSERT INTO product2 VALUES(
        '216573141', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product2 VALUES(
        '216573142', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product2 VALUES(
        '216573143', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product2 VALUES(
        '216573144', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product2 VALUES(
        '216573145', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product2 VALUES(
        '216573146', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product2 VALUES(
        '216573147', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product2 VALUES(
        '216573148', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product2 VALUES(
        '216573149', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');
INSERT INTO product2 VALUES(
        '216573150', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F');

In [17]:
# commit
db.commit()

In [18]:
# 재원 반납
db.close()

## SELECT

In [19]:
# db 연결
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='1234',
                     db='ecommerce', charset='utf8')
cursor = db.cursor()

In [20]:
sql = "SELECT * FROM product2"
cursor.execute(sql)

10

In [22]:
result = cursor.fetchone() # 현재 커서를 다음 레코드로 이동시키고 해당 레코드를 반환
result

('216573141', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F')

In [23]:
result = cursor.fetchall() # 모든 레코드 반환 / 앞에서 얻은 레코드는 반환되지 않는다.
result

(('216573142', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'),
 ('216573143', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'),
 ('216573144', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'),
 ('216573145', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'),
 ('216573146', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'),
 ('216573147', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'),
 ('216573148', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'),
 ('216573149', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'),
 ('216573150', '스위트바니 여름신상5900원~롱원피스티셔츠/긴팔/반팔', 23000, 6900, 70, 'F'))

In [24]:
db.close()

## UPDATE

In [25]:
# db 연결
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='1234',
                     db='ecommerce', charset='utf8')
cursor = db.cursor()

In [27]:
sql = """
    UPDATE product2 SET
        TITLE='하늘하늘 원피스 썸머 스페셜 가디건',
        ORI_PRICE=33000,
        DISCOUNT_PRICE=9900,
        DISCOUNT_PERCENT=70
        WHERE PRODUCT_CODE='216573141';
"""

cursor.execute(sql)

db.commit()

In [28]:
# update가 잘 되었는지 확인
sql = "SELECT * FROM product2 WHERE PRODUCT_CODE='216573141'"
cursor.execute(sql)
result = cursor.fetchone()
result

('216573141', '하늘하늘 원피스 썸머 스페셜 가디건', 33000, 9900, 70, 'F')

In [29]:
db.close()

## DELETE

In [30]:
# db 연결
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='1234',
                     db='ecommerce', charset='utf8')
cursor = db.cursor()

In [31]:
sql = "DELETE FROM product2 WHERE PRODUCT_CODE='216573141'"
cursor.execute(sql)
db.commit()
db.close()

In [32]:
# delete가 잘 되었는지 확인
# db 연결
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='1234',
                     db='ecommerce', charset='utf8')
cursor = db.cursor()

sql = "SELECT * FROM product2 WHERE PRODUCT_CODE='216573141'"

cursor.execute(sql)

result = cursor.fetchone()
print(result)

db.commit()
db.close()

None

## pandas - pymysql

In [33]:
import pymysql
import pandas as pd

In [34]:
host_name = 'localhost'
host_port = 3306
username = 'root'
password = '1234'
database_name = 'student_mgmt'

In [35]:
# db 연결
db = pymysql.connect(
    host=host_name,
    port=host_port,
    user=username,
    passwd=password,
    db=database_name,
    charset='utf8'
)

In [36]:
sql = "SHOW TABLES"
df = pd.read_sql(sql, db) # SQL에서 받아온 정보를 DataFrame으로 반환
df

C:\Users\hw981\AppData\Local\Temp\ipykernel_796\1358800271.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, db) # SQL에서 받아온 정보를 DataFrame으로 반환

  Tables_in_student_mgmt
0               students

In [37]:
sql = "SELECT * FROM students"
df = pd.read_sql(sql, db)
df

C:\Users\hw981\AppData\Local\Temp\ipykernel_796\1391524238.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, db)

   id    name gender       birth  english  math  korean
0   1    dave    man  1983-07-16       90    80      71
1   2  minsun  woman  1982-10-16       30    88      60
2   3   david    man  1982-12-10       78    77      30
3   4    jade    man  1979-11-01       45    66      20
4   5    jane    man  1990-11-12       65    32      90
5   6    wage  woman  1982-01-13       76    30      80
6   7    tina  woman  1982-12-03       87    62      71

In [38]:
type(df['math'][0]) # 데이터의 컬럼 형식을 그대로 유지

numpy.int64

In [39]:
# 필요한 경우 csv 파일로 만들 수 있음
df.to_csv('students.csv', sep=',', index=False, encoding='utf-8')
df

   id    name gender       birth  english  math  korean
0   1    dave    man  1983-07-16       90    80      71
1   2  minsun  woman  1982-10-16       30    88      60
2   3   david    man  1982-12-10       78    77      30
3   4    jade    man  1979-11-01       45    66      20
4   5    jane    man  1990-11-12       65    32      90
5   6    wage  woman  1982-01-13       76    30      80
6   7    tina  woman  1982-12-03       87    62      71

In [40]:
db.close()

## 외래키(FOREIGN KEY)

In [41]:
import pymysql
import pandas as pd

In [42]:
host_name = 'localhost'
host_port = 3306
username = 'root'
password = '1234'
database_name = 'sqlDB'

In [43]:
# db 연결
db = pymysql.connect(
    host=host_name,
    port=host_port,
    user=username,
    passwd=password,
    db=database_name,
    charset='utf8'
)

In [44]:
sql = "SELECT * FROM userTbl;"
df = pd.read_sql(sql, db)
df

C:\Users\hw981\AppData\Local\Temp\ipykernel_796\1641681119.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, db)

  userID name  birthYear addr mobile1  mobile2  height       mDate
0    BBK  바비킴       1973   서울     010  0000000     176  2013-05-05
1    EJW  은지원       1972   경북     011  8888888     174  2014-03-03
2    JKW  조관우       1965   경기     018  9999999     172  2010-10-10
3    JYP  조용필       1950   경기     011  4444444     166  2009-04-04
4    KBS  김범수       1979   경남     011  2222222     173  2012-04-04
5    KKH  김경호       1971   전남     019  3333333     177  2007-07-07
6    LJB  임재범       1963   서울     016  6666666     182  2009-09-09
7    LSG  이승기       1987   서울     011  1111111     182  2008-08-08
8    SSK  성시경       1979   서울    None     None     186  2013-12-12
9    YJS  윤종신       1969   경남    None     None     170  2005-05-05

In [45]:
sql = "SELECT * FROM buyTbl;"
df = pd.read_sql(sql, db)
df

C:\Users\hw981\AppData\Local\Temp\ipykernel_796\3671299026.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, db)

    num userID prodName groupName  price  amount
0     1    KBS      운동화      None     30       2
1     2    KBS      노트북        전자   1000       1
2     3    JYP      모니터        전자    200       1
3     4    BBK      모니터        전자    200       5
4     5    KBS      청바지        의류     50       3
5     6    BBK      메모리        전자     80      10
6     7    SSK        책        서적     15       5
7     8    EJW        책        서적     15       2
8     9    EJW      청바지        의류     50       1
9    10    BBK      운동화      None     30       2
10   11    EJW        책        서적     15       1
11   12    BBK      운동화      None     30       2

In [46]:
# buyTbl에 데이터 추가
cursor = db.cursor()
sql_query = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES ('STJ', '운동화', '의류', 30, 2);"
cursor.execute(sql_query)
db.commit()

IntegrityError: (1452, 'Cannot add or update a child row: a foreign key constraint fails (`sqldb`.`buytbl`, CONSTRAINT `buytbl_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `usertbl` (`userID`))')

'STJ'라는 ID가 없기 때문에 에러 발생

In [47]:
cursor = db.cursor()
sql_query = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES ('BBK', '운동화', '의류', 30, 1);"
cursor.execute(sql_query)
db.commit()

In [48]:
# STJ 데이터를 생성 후 다시 넣어보기
sql_query = "INSERT INTO userTbl VALUES ('STJ', '서태지', 1975, '경기', '011', '00000000', 171, '2018-05-08');"
cursor.execute(sql_query)
db.commit()

In [49]:
sql_query = "INSERT INTO buyTbl (userID, prodName, groupName, price, amount) VALUES ('STJ', '운동화', '의류', 30, 2);"
cursor.execute(sql_query)
db.commit() # 정상 실행

In [50]:
# userTbl에서 STJ 관련 데이터를 삭제
sql_query = "DELETE FROM userTbl WHERE userID='STJ';"
cursor.execute(sql_query)
db.commit()

IntegrityError: (1451, 'Cannot delete or update a parent row: a foreign key constraint fails (`sqldb`.`buytbl`, CONSTRAINT `buytbl_ibfk_1` FOREIGN KEY (`userID`) REFERENCES `usertbl` (`userID`))')

참조하고 있는 데이터가 있기 때문에 바로 삭제 불가능